Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.107/BZ25/include/pic32cx1012bz25048.h
/* CMSIS includes */
#include "core_cm4.h"
#if defined USE_CMSIS_INIT
#include "system_bz25.h"
#endif /* USE_CMSIS_INIT */

/* ************************************************************************** */
/*   SOFTWARE PERIPHERAL API DEFINITION FOR PIC32CX1012BZ25048                */
/* ************************************************************************** */
#include "component/ac.h"
#include "component/adchs.h"
#include "component/aes.h"
#include "component/arb.h"
#include "component/ble.h"
#include "component/btzbsys.h"
#include "component/ccl.h"
#include "component/cfg.h"
#include "component/cmcc.h"
#include "component/cru.h"
#include "component/dmac.h"
#include "component/dmt.h"
#include "component/dscon.h"
#include "component/dsu.h"
#include "component/eic.h"
#include "component/evsys.h"
#include "component/freqm.h"
#include "component/fuses.h"
#include "component/gpio.h"
#include "component/hmatrixb.h"
#include "component/icm.h"
#include "component/nvm.h"
#include "component/pac.h"
#include "component/pche.h"
#include "component/pfw.h"
#include "component/pmu.h"
#include "component/pps.h"
#include "component/pukcc.h"
#include "component/qspi.h"
#include "component/ramecc.h"
#include "component/rcon.h"
#include "component/rtc.h"
#include "component/sercom.h"
#include "component/tc.h"
#include "component/tcc.h"
#include "component/trng.h"
#include "component/wdt.h"
#include "component/zigbee.h"

/* ************************************************************************** */
/*   INSTANCE DEFINITIONS FOR PIC32CX1012BZ25048 */
/* ************************************************************************** */
#include "instance/ac.h"
#include "instance/adchs.h"
#include "instance/aes.h"
#include "instance/arb.h"
#include "instance/ble.h"
#include "instance/btzbsys.h"
#include "instance/ccl.h"
#include "instance/cfg.h"
#include "instance/cmcc.h"
#include "instance/cru.h"
#include "instance/dmac.h"
#include "instance/dmt.h"
#include "instance/dscon.h"
#include "instance/dsu.h"
#include "instance/eic.h"
#include "instance/evsys.h"
#include "instance/freqm.h"
#include "instance/fuses.h"
#include "instance/gpioa.h"
#include "instance/gpiob.h"
#include "instance/hmatrix.h"
#include "instance/icm.h"
#include "instance/nvm.h"
#include "instance/pac.h"
#include "instance/pche.h"
#include "instance/pfw.h"
#include "instance/pmu.h"
#include "instance/pps.h"
#include "instance/qspi.h"
#include "instance/ramecc.h"
#include "instance/rcon.h"
#include "instance/rtc.h"
#include "instance/sercom0.h"
#include "instance/sercom1.h"
#include "instance/sercom2.h"
#include "instance/sercom3.h"
#include "instance/tc0.h"
#include "instance/tc1.h"
#include "instance/tc2.h"
#include "instance/tc3.h"
#include "instance/tcc0.h"
#include "instance/tcc1.h"
#include "instance/tcc2.h"
#include "instance/trng.h"
#include "instance/wdt.h"
#include "instance/zigbee.h"

/* ************************************************************************** */
/*  PERIPHERAL ID DEFINITIONS FOR PIC32CX1012BZ25048                          */
/* ************************************************************************** */
#define ID_PAC           (  0) /* Peripheral Access Controller (PAC) */
#define ID_FREQM         (  1) /* Frequency Meter (FREQM) */
#define ID_EIC           (  2) /* External Interrupt Controller (EIC) */
#define ID_SERCOM0       (  3) /* Serial Communication Interface (SERCOM0) */
#define ID_SERCOM1       (  4) /* Serial Communication Interface (SERCOM1) */
#define ID_TC0           (  5) /* Basic Timer Counter (TC0) */
#define ID_TC1           (  6) /* Basic Timer Counter (TC1) */
#define ID_TC2           (  7) /* Basic Timer Counter (TC2) */
#define ID_TC3           (  8) /* Basic Timer Counter (TC3) */
#define ID_TCC0          (  9) /* Timer Counter Control (TCC0) */
#define ID_TCC1          ( 10) /* Timer Counter Control (TCC1) */
#define ID_TCC2          ( 11) /* Timer Counter Control (TCC2) */
#define ID_DSU           ( 32) /* Device Service Unit (DSU) */
#define ID_CMCC          ( 33) /* Cortex M Cache Controller (CMCC) */
#define ID_DMAC          ( 34) /* Direct Memory Access Controller (DMAC) */
#define ID_EVSYS         ( 35) /* Event System Interface (EVSYS) */
#define ID_RAMECC        ( 36) /* RAM ECC (RAMECC) */
#define ID_QSPI          ( 64) /* Quad SPI interface (QSPI) */
#define ID_AES           ( 65) /* Advanced Encryption Standard (AES) */
#define ID_SERCOM2       ( 67) /* Serial Communication Interface (SERCOM2) */
#define ID_SERCOM3       ( 68) /* Serial Communication Interface (SERCOM3) */
#define ID_CCL           ( 70) /* Configurable Custom Logic (CCL) */
#define ID_AC            ( 71) /* Analog Comparators (AC) */
#define ID_HMATRIX       ( 73) /* HSB Matrix (HMATRIX) */
#define ID_TRNG          ( 74) /* True Random Generator (TRNG) */
#define ID_ICM           ( 75) /* Integrity Check Monitor (ICM) */
#define ID_PUKCC         ( 76) /* PUblic-Key Cryptography Controller (PUKCC) */
#define ID_RTC           ( 78) /* Real-Time Counter (RTC) */
#define ID_DSCON         ( 79) /*  (DSCON) */

#define ID_PERIPH_MAX    ( 79) /* Number of peripheral IDs */

/* ************************************************************************** */
/*   REGISTER STRUCTURE ADDRESS DEFINITIONS FOR PIC32CX1012BZ25048            */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#define AC_REGS                          ((ac_registers_t*)0x42001c00)                 /* AC Registers Address         */
#define ADCHS_REGS                       ((adchs_registers_t*)0x44001400)              /* ADCHS Registers Address      */
#define AES_REGS                         ((aes_registers_t*)0x42000400)                /* AES Registers Address        */
#define BLE_REGS                         ((ble_registers_t*)0x41012000)                /* BLE Registers Address        */
#define BTZBSYS_REGS                     ((btzbsys_registers_t*)0x41014000)            /* BTZBSYS Registers Address    */
#define CCL_REGS                         ((ccl_registers_t*)0x42001800)                /* CCL Registers Address        */
#define CFG_REGS                         ((cfg_registers_t*)0x44000000)                /* CFG Registers Address        */
#define CMCC_REGS                        ((cmcc_registers_t*)0x41002000)               /* CMCC Registers Address       */
#define CRU_REGS                         ((cru_registers_t*)0x44000a00)                /* CRU Registers Address        */
#define RCON_REGS                        ((rcon_registers_t*)0x44000a00)               /* RCON Registers Address       */
#define DMAC_REGS                        ((dmac_registers_t*)0x41004000)               /* DMAC Registers Address       */
#define DMT_REGS                         ((dmt_registers_t*)0x44000e00)                /* DMT Registers Address        */
#define DSCON_REGS                       ((dscon_registers_t*)0x42011000)              /* DSCON Registers Address      */
#define DSU_REGS                         ((dsu_registers_t*)0x41000000)                /* DSU Registers Address        */
#define EIC_REGS                         ((eic_registers_t*)0x40000800)                /* EIC Registers Address        */
#define EVSYS_REGS                       ((evsys_registers_t*)0x41006000)              /* EVSYS Registers Address      */
#define NVM_REGS                         ((nvm_registers_t*)0x44000600)                /* NVM Registers Address        */
#define FREQM_REGS                       ((freqm_registers_t*)0x40000400)              /* FREQM Registers Address      */
#define USER_FUSES_REGS                  ((fuses_user_fuses_registers_t*)0x00045e80)   /* FUSES Registers Address      */
#define GPIOA_REGS                       ((gpio_registers_t*)0x44002200)               /* GPIOA Registers Address      */
#define GPIOB_REGS                       ((gpio_registers_t*)0x44002300)               /* GPIOB Registers Address      */
#define HMATRIX_REGS                     ((hmatrixb_registers_t*)0x42002400)           /* HMATRIX Registers Address    */
#define ICM_REGS                         ((icm_registers_t*)0x42002c00)                /* ICM Registers Address        */
#define PAC_REGS                         ((pac_registers_t*)0x40000000)                /* PAC Registers Address        */
#define PCHE_REGS                        ((pche_registers_t*)0x44012400)               /* PCHE Registers Address       */
#define PFW_REGS                         ((pfw_registers_t*)0x44000800)                /* PFW Registers Address        */
#define PMU_REGS                         ((pmu_registers_t*)0x44013e00)                /* PMU Registers Address        */
#define PPS_REGS                         ((pps_registers_t*)0x44001000)                /* PPS Registers Address        */
#define QSPI_REGS                        ((qspi_registers_t*)0x42000000)               /* QSPI Registers Address       */
#define RAMECC_REGS                      ((ramecc_registers_t*)0x41008000)             /* RAMECC Registers Address     */
#define RTC_REGS                         ((rtc_registers_t*)0x42010000)                /* RTC Registers Address        */
#define SERCOM0_REGS                     ((sercom_registers_t*)0x40000c00)             /* SERCOM0 Registers Address    */
#define SERCOM1_REGS                     ((sercom_registers_t*)0x40001000)             /* SERCOM1 Registers Address    */
#define SERCOM2_REGS                     ((sercom_registers_t*)0x42000c00)             /* SERCOM2 Registers Address    */
#define SERCOM3_REGS                     ((sercom_registers_t*)0x42001000)             /* SERCOM3 Registers Address    */
#define TC0_REGS                         ((tc_registers_t*)0x40001400)                 /* TC0 Registers Address        */
#define TC1_REGS                         ((tc_registers_t*)0x40001800)                 /* TC1 Registers Address        */
#define TC2_REGS                         ((tc_registers_t*)0x40001c00)                 /* TC2 Registers Address        */
#define TC3_REGS                         ((tc_registers_t*)0x40002000)                 /* TC3 Registers Address        */
#define TCC0_REGS                        ((tcc_registers_t*)0x40002400)                /* TCC0 Registers Address       */
#define TCC1_REGS                        ((tcc_registers_t*)0x40002800)                /* TCC1 Registers Address       */
#define TCC2_REGS                        ((tcc_registers_t*)0x40002c00)                /* TCC2 Registers Address       */
#define TRNG_REGS                        ((trng_registers_t*)0x42002800)               /* TRNG Registers Address       */
#define WDT_REGS                         ((wdt_registers_t*)0x44000500)                /* WDT Registers Address        */
#define ZIGBEE_REGS                      ((zigbee_registers_t*)0x41010000)             /* ZIGBEE Registers Address     */
#define ARB_REGS                         ((arb_registers_t*)0x41011000)                /* ARB Registers Address        */
#endif /* (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

/* ************************************************************************** */
/*   BASE ADDRESS DEFINITIONS FOR PIC32CX1012BZ25048                          */
/* ************************************************************************** */
#define AC_BASE_ADDRESS                  _UINT32_(0x42001c00)                          /* AC Base Address */
#define ADCHS_BASE_ADDRESS               _UINT32_(0x44001400)                          /* ADCHS Base Address */
#define AES_BASE_ADDRESS                 _UINT32_(0x42000400)                          /* AES Base Address */
#define BLE_BASE_ADDRESS                 _UINT32_(0x41012000)                          /* BLE Base Address */
#define BTZBSYS_BASE_ADDRESS             _UINT32_(0x41014000)                          /* BTZBSYS Base Address */
#define CCL_BASE_ADDRESS                 _UINT32_(0x42001800)                          /* CCL Base Address */
#define CFG_BASE_ADDRESS                 _UINT32_(0x44000000)                          /* CFG Base Address */
#define CMCC_BASE_ADDRESS                _UINT32_(0x41002000)                          /* CMCC Base Address */
#define CRU_BASE_ADDRESS                 _UINT32_(0x44000a00)                          /* CRU Base Address */
#define RCON_BASE_ADDRESS                _UINT32_(0x44000a00)                          /* RCON Base Address */
#define DMAC_BASE_ADDRESS                _UINT32_(0x41004000)                          /* DMAC Base Address */
#define DMT_BASE_ADDRESS                 _UINT32_(0x44000e00)                          /* DMT Base Address */
#define DSCON_BASE_ADDRESS               _UINT32_(0x42011000)                          /* DSCON Base Address */
#define DSU_BASE_ADDRESS                 _UINT32_(0x41000000)                          /* DSU Base Address */
#define EIC_BASE_ADDRESS                 _UINT32_(0x40000800)                          /* EIC Base Address */
#define EVSYS_BASE_ADDRESS               _UINT32_(0x41006000)                          /* EVSYS Base Address */
#define NVM_BASE_ADDRESS                 _UINT32_(0x44000600)                          /* NVM Base Address */
#define FREQM_BASE_ADDRESS               _UINT32_(0x40000400)                          /* FREQM Base Address */
#define USER_FUSES_BASE_ADDRESS          _UINT32_(0x00045e80)                          /* FUSES Base Address */
#define GPIOA_BASE_ADDRESS               _UINT32_(0x44002200)                          /* GPIOA Base Address */
#define GPIOB_BASE_ADDRESS               _UINT32_(0x44002300)                          /* GPIOB Base Address */
#define HMATRIX_BASE_ADDRESS             _UINT32_(0x42002400)                          /* HMATRIX Base Address */
#define ICM_BASE_ADDRESS                 _UINT32_(0x42002c00)                          /* ICM Base Address */
#define PAC_BASE_ADDRESS                 _UINT32_(0x40000000)                          /* PAC Base Address */
#define PCHE_BASE_ADDRESS                _UINT32_(0x44012400)                          /* PCHE Base Address */
#define PFW_BASE_ADDRESS                 _UINT32_(0x44000800)                          /* PFW Base Address */
#define PMU_BASE_ADDRESS                 _UINT32_(0x44013e00)                          /* PMU Base Address */
#define PPS_BASE_ADDRESS                 _UINT32_(0x44001000)                          /* PPS Base Address */
#define QSPI_BASE_ADDRESS                _UINT32_(0x42000000)                          /* QSPI Base Address */
#define RAMECC_BASE_ADDRESS              _UINT32_(0x41008000)                          /* RAMECC Base Address */
#define RTC_BASE_ADDRESS                 _UINT32_(0x42010000)                          /* RTC Base Address */
#define SERCOM0_BASE_ADDRESS             _UINT32_(0x40000c00)                          /* SERCOM0 Base Address */
#define SERCOM1_BASE_ADDRESS             _UINT32_(0x40001000)                          /* SERCOM1 Base Address */
#define SERCOM2_BASE_ADDRESS             _UINT32_(0x42000c00)                          /* SERCOM2 Base Address */
#define SERCOM3_BASE_ADDRESS             _UINT32_(0x42001000)                          /* SERCOM3 Base Address */
#define TC0_BASE_ADDRESS                 _UINT32_(0x40001400)                          /* TC0 Base Address */
#define TC1_BASE_ADDRESS                 _UINT32_(0x40001800)                          /* TC1 Base Address */
#define TC2_BASE_ADDRESS                 _UINT32_(0x40001c00)                          /* TC2 Base Address */
#define TC3_BASE_ADDRESS                 _UINT32_(0x40002000)                          /* TC3 Base Address */
#define TCC0_BASE_ADDRESS                _UINT32_(0x40002400)                          /* TCC0 Base Address */
#define TCC1_BASE_ADDRESS                _UINT32_(0x40002800)                          /* TCC1 Base Address */
#define TCC2_BASE_ADDRESS                _UINT32_(0x40002c00)                          /* TCC2 Base Address */
#define TRNG_BASE_ADDRESS                _UINT32_(0x42002800)                          /* TRNG Base Address */
#define WDT_BASE_ADDRESS                 _UINT32_(0x44000500)                          /* WDT Base Address */
#define ZIGBEE_BASE_ADDRESS              _UINT32_(0x41010000)                          /* ZIGBEE Base Address */
#define ARB_BASE_ADDRESS                 _UINT32_(0x41011000)                          /* ARB Base Address */

/* ************************************************************************** */
/*   PIO DEFINITIONS FOR PIC32CX1012BZ25048                                   */
/* ************************************************************************** */
#include "pio/pic32cx1012bz25048.h"

/* ************************************************************************** */
/*   MEMORY MAPPING DEFINITIONS FOR PIC32CX1012BZ25048                        */
/* ************************************************************************** */
#define CMCC_SIZE                      _UINT32_(0x01000000)    /* 16384kB Memory segment type: io */
#define CMCC_DATARAM_SIZE              _UINT32_(0x00001000)    /*    4kB Memory segment type: io */
#define CMCC_TAGRAM_SIZE               _UINT32_(0x00000400)    /*    1kB Memory segment type: io */
#define CMCC_VALIDRAM_SIZE             _UINT32_(0x00000040)    /*    0kB Memory segment type: io */
#define HSRAM_SIZE                     _UINT32_(0x00020000)    /*  128kB Memory segment type: ram */
#define HSRAM_ETB_SIZE                 _UINT32_(0x00008000)    /*   32kB Memory segment type: ram */
#define HSRAM_RET1_SIZE                _UINT32_(0x00008000)    /*   32kB Memory segment type: ram */
#define PBA_SIZE                       _UINT32_(0x01000000)    /* 16384kB Memory segment type: io */
#define PBB_SIZE                       _UINT32_(0x01000000)    /* 16384kB Memory segment type: io */
#define PBC_SIZE                       _UINT32_(0x01000000)    /* 16384kB Memory segment type: io */
#define PB_PIC_SIZE                    _UINT32_(0x00020000)    /*  128kB Memory segment type: io */
#define BKUPRAM_SIZE                   _UINT32_(0x00002000)    /*    8kB Memory segment type: ram */
#define FLASH_SIZE                     _UINT32_(0x00100000)    /* 1024kB Memory segment type: flash */
#define FLASH_PAGE_SIZE                _UINT32_(      4096)
#define FLASH_NB_OF_PAGES              _UINT32_(       256)

#define PPB_SIZE                       _UINT32_(0x00100000)    /* 1024kB Memory segment type: io */
#define QSPI_SIZE                      _UINT32_(0x01000000)    /* 16384kB Memory segment type: other */
#define SCS_SIZE                       _UINT32_(0x00001000)    /*    4kB Memory segment type: io */
#define BOOT_FLASH_SIZE                _UINT32_(0x00005e00)    /*   23kB Memory segment type: flash */

#define CMCC_ADDR                      _UINT32_(0x03000000)    /* CMCC base address (type: io)*/
#define CMCC_DATARAM_ADDR              _UINT32_(0x03000000)    /* CMCC_DATARAM base address (type: io)*/
#define CMCC_TAGRAM_ADDR               _UINT32_(0x03001000)    /* CMCC_TAGRAM base address (type: io)*/
#define CMCC_VALIDRAM_ADDR             _UINT32_(0x03002000)    /* CMCC_VALIDRAM base address (type: io)*/
#define HSRAM_ADDR                     _UINT32_(0x20000000)    /* HSRAM base address (type: ram)*/
#define HSRAM_ETB_ADDR                 _UINT32_(0x20000000)    /* HSRAM_ETB base address (type: ram)*/
#define HSRAM_RET1_ADDR                _UINT32_(0x20000000)    /* HSRAM_RET1 base address (type: ram)*/
#define PBA_ADDR                       _UINT32_(0x40000000)    /* PBA base address (type: io)*/
#define PBB_ADDR                       _UINT32_(0x41000000)    /* PBB base address (type: io)*/
#define PBC_ADDR                       _UINT32_(0x42000000)    /* PBC base address (type: io)*/
#define PB_PIC_ADDR                    _UINT32_(0x44000000)    /* PB_PIC base address (type: io)*/
#define BKUPRAM_ADDR                   _UINT32_(0x44014000)    /* BKUPRAM base address (type: ram)*/
#define FLASH_ADDR                     _UINT32_(0x01000000)    /* FLASH base address (type: flash)*/
#define PPB_ADDR                       _UINT32_(0xe0000000)    /* PPB base address (type: io)*/
#define QSPI_ADDR                      _UINT32_(0x04000000)    /* QSPI base address (type: other)*/
#define SCS_ADDR                       _UINT32_(0xe000e000)    /* SCS base address (type: io)*/
#define BOOT_FLASH_ADDR                _UINT32_(0x00000000)    /* BOOT_FLASH base address (type: flash)*/

/* ************************************************************************** */
/*   DEVICE SIGNATURES FOR PIC32CX1012BZ25048                                 */
/* ************************************************************************** */
#define CHIP_JTAGID                    _UINT32_(0X09B8F053)
#define CHIP_DSU_DID                   _UINT32_(0X00009B8F)

/* ************************************************************************** */
/*   ELECTRICAL DEFINITIONS FOR PIC32CX1012BZ25048                            */
/* ************************************************************************** */

